03-editing/init-org-mode.org
*** Configuration

#+begin_src emacs-lisp :tangle yes

;;================================================================
;; Config for Refile
;;================================================================
;;


;; Targets include this file and any file contributing to the agenda - up to 9 levels deep
(setq org-refile-targets (quote ((nil :maxlevel . 9)
                                 (org-agenda-files :maxlevel . 9))))

;; Use full outline paths for refile targets - we file directly with IDO
(setq org-refile-use-outline-path t)

;; Targets complete directly with IDO
(setq org-outline-path-complete-in-steps nil)

;; Allow refile to create parent tasks with confirmation
(setq org-refile-allow-creating-parent-nodes (quote confirm))

;; Use IDO for both buffer and file completion and ido-everywhere to t
(setq org-completion-use-ido t)
(setq ido-everywhere t)
(setq ido-max-directory-size 100000)
(ido-mode (quote both))
;; Use the current window when visiting files and buffers with ido
(setq ido-default-file-method 'selected-window)
(setq ido-default-buffer-method 'selected-window)
;; Use the current window for indirect buffer display
(setq org-indirect-buffer-display 'current-window)

;;;; Refile settings
;; Exclude DONE state tasks from refile targets
(defun bh/verify-refile-target ()
  "Exclude todo keywords with a done state from refile targets"
  (not (member (nth 2 (org-heading-components)) org-done-keywords)))

(setq org-refile-target-verify-function 'bh/verify-refile-target)

#+end_src

*** Shot-key binding
当前的配置操作快捷键：
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| Refile        | C-c C-w                    | 将此标签任务迁移到其它文件中                                                              |
|               | C-c M-w                    | 同上，并保留当前文件内容                                                                  |
|               |                            |                                                                                           |
|               |                            |                                                                                           |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|

** Org Clocking
Org clocking模式，在任务上启动clocking，则开始对特定任务启动计时，并通过clocking 统计在各个任务中花的时间，通过汇总统计，则可以检查一天的工作情况。
