03-editing/init-org-mode.md

### Configuration<a id="sec-1-3-1" name="sec-1-3-1"></a>

    ;;================================================================
    ;; Config for Refile
    ;;================================================================
    ;;
    
    
    ;; Targets include this file and any file contributing to the agenda - up to 9 levels deep
    (setq org-refile-targets (quote ((nil :maxlevel . 9)
                                     (org-agenda-files :maxlevel . 9))))
    
    ;; Use full outline paths for refile targets - we file directly with IDO
    (setq org-refile-use-outline-path t)
    
    ;; Targets complete directly with IDO
    (setq org-outline-path-complete-in-steps nil)
    
    ;; Allow refile to create parent tasks with confirmation
    (setq org-refile-allow-creating-parent-nodes (quote confirm))
    
    ;; Use IDO for both buffer and file completion and ido-everywhere to t
    (setq org-completion-use-ido t)
    (setq ido-everywhere t)
    (setq ido-max-directory-size 100000)
    (ido-mode (quote both))
    ;; Use the current window when visiting files and buffers with ido
    (setq ido-default-file-method 'selected-window)
    (setq ido-default-buffer-method 'selected-window)
    ;; Use the current window for indirect buffer display
    (setq org-indirect-buffer-display 'current-window)
    
    ;;;; Refile settings
    ;; Exclude DONE state tasks from refile targets
    (defun bh/verify-refile-target ()
      "Exclude todo keywords with a done state from refile targets"
      (not (member (nth 2 (org-heading-components)) org-done-keywords)))
    
    (setq org-refile-target-verify-function 'bh/verify-refile-target)

### Shot-key binding<a id="sec-1-3-2" name="sec-1-3-2"></a>

当前的配置操作快捷键：

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">Refile</td>
<td class="left">C-c C-w</td>
<td class="left">将此标签任务迁移到其它文件中</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c M-w</td>
<td class="left">同上，并保留当前文件内容</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

## Org Clocking<a id="sec-1-4" name="sec-1-4"></a>

Org clocking模式，在任务上启动clocking，则开始对特定任务启动计时，并通过clocking 统计在各个任务中花的时间，通过汇总统计，则可以检查一天的工作情况。
