03-editing/init-org-mode.md

### Configuration<a id="sec-1-4-1" name="sec-1-4-1"></a>

    ;;================================================================
    ;; Config for Clock
    ;;================================================================
    ;;
    
    ;;
    ;; Resume clocking task when emacs is restarted
    (org-clock-persistence-insinuate)
    ;;
    ;; Show lot of clocking history so it's easy to pick items off the C-F11 list
    (setq org-clock-history-length 23)
    ;; Resume clocking task on clock-in if the clock is open
    (setq org-clock-in-resume t)
    ;; Change tasks to NEXT when clocking in
    (setq org-clock-in-switch-to-state 'bh/clock-in-to-next)
    ;; Separate drawers for clocking and logs
    (setq org-drawers (quote ("PROPERTIES" "LOGBOOK")))
    ;; Save clock data and state changes and notes in the LOGBOOK drawer
    (setq org-clock-into-drawer t)
    ;; Sometimes I change tasks I'm clocking quickly - this removes clocked tasks with 0:00 duration
    (setq org-clock-out-remove-zero-time-clocks t)
    ;; Clock out when moving task to a done state
    (setq org-clock-out-when-done t)
    ;; Save the running clock and all clock history when exiting Emacs, load it on startup
    (setq org-clock-persist t)
    ;; Do not prompt to resume an active clock
    (setq org-clock-persist-query-resume nil)
    ;; Enable auto clock resolution for finding open clocks
    (setq org-clock-auto-clock-resolution (quote when-no-clock-is-running))
    ;; Include current clocking task in clock reports
    (setq org-clock-report-include-clocking-task t)
    
    (setq bh/keep-clock-running nil)
    
    (defun bh/clock-in-to-next (kw)
      "Switch a task from TODO to NEXT when clocking in.
    Skips capture tasks, projects, and subprojects.
    Switch projects and subprojects from NEXT back to TODO"
      (when (not (and (boundp 'org-capture-mode) org-capture-mode))
        (cond
         ((and (member (org-get-todo-state) (list "TODO"))
               (bh/is-task-p))
          "NEXT")
         ((and (member (org-get-todo-state) (list "NEXT"))
               (bh/is-project-p))
          "TODO"))))
    
    (defun bh/find-project-task ()
      "Move point to the parent (project) task if any"
      (save-restriction
        (widen)
        (let ((parent-task (save-excursion (org-back-to-heading 'invisible-ok) (point))))
          (while (org-up-heading-safe)
            (when (member (nth 2 (org-heading-components)) org-todo-keywords-1)
              (setq parent-task (point))))
          (goto-char parent-task)
          parent-task)))
    
    (defun bh/punch-in (arg)
      "Start continuous clocking and set the default task to the
    selected task.  If no task is selected set the Organization task
    as the default task."
      (interactive "p")
      (setq bh/keep-clock-running t)
      (if (equal major-mode 'org-agenda-mode)
          ;;
          ;; We're in the agenda
          ;;
          (let* ((marker (org-get-at-bol 'org-hd-marker))
                 (tags (org-with-point-at marker (org-get-tags-at))))
            (if (and (eq arg 4) tags)
                (org-agenda-clock-in '(16))
              (bh/clock-in-organization-task-as-default)))
        ;;
        ;; We are not in the agenda
        ;;
        (save-restriction
          (widen)
                                            ; Find the tags on the current task
          (if (and (equal major-mode 'org-mode) (not (org-before-first-heading-p)) (eq arg 4))
              (org-clock-in '(16))
            (bh/clock-in-organization-task-as-default)))))
    
    (defun bh/punch-out ()
      (interactive)
      (setq bh/keep-clock-running nil)
      (when (org-clock-is-active)
        (org-clock-out))
      (org-agenda-remove-restriction-lock))
    
    (defun bh/clock-in-default-task ()
      (save-excursion
        (org-with-point-at org-clock-default-task
          (org-clock-in))))
    
    (defun bh/clock-in-parent-task ()
      "Move point to the parent (project) task if any and clock in"
      (let ((parent-task))
        (save-excursion
          (save-restriction
            (widen)
            (while (and (not parent-task) (org-up-heading-safe))
              (when (member (nth 2 (org-heading-components)) org-todo-keywords-1)
                (setq parent-task (point))))
            (if parent-task
                (org-with-point-at parent-task
                  (org-clock-in))
              (when bh/keep-clock-running
                (bh/clock-in-default-task)))))))
    
    (defvar bh/organization-task-id "eb155a82-92b2-4f25-a3c6-0304591af2f9")
    
    (defun bh/clock-in-organization-task-as-default ()
      (interactive)
      (org-with-point-at (org-id-find bh/organization-task-id 'marker)
        (org-clock-in '(16))))
    
    (defun bh/clock-out-maybe ()
      (when (and bh/keep-clock-running
                 (not org-clock-clocking-in)
                 (marker-buffer org-clock-default-task)
                 (not org-clock-resolving-clocks-due-to-idleness))
        (bh/clock-in-parent-task)))
    
    (add-hook 'org-clock-out-hook 'bh/clock-out-maybe 'append)
    
    (defun bh/resume-clock ()
      (interactive)
      (if (marker-buffer org-clock-interrupted-task)
          (org-with-point-at org-clock-interrupted-task
            (org-clock-in))
        (org-clock-out)))
    
    (require 'org-id)
    (defun bh/clock-in-task-by-id (id)
      "Clock in a task by id"
      (org-with-point-at (org-id-find id 'marker)
        (org-clock-in nil)))
    
    (defun bh/clock-in-last-task (arg)
      "Clock in the interrupted task if there is one
    Skip the default task and get the next one.
    A prefix arg forces clock in of the default task."
      (interactive "p")
      (let ((clock-in-to-task
             (cond
              ((eq arg 4) org-clock-default-task)
              ((and (org-clock-is-active)
                    (equal org-clock-default-task (cadr org-clock-history)))
               (caddr org-clock-history))
              ((org-clock-is-active) (cadr org-clock-history))
              ((equal org-clock-default-task (car org-clock-history)) (cadr org-clock-history))
              (t (car org-clock-history)))))
        (widen)
        (org-with-point-at clock-in-to-task
          (org-clock-in nil))))

### Shot-key bindings<a id="sec-1-4-2" name="sec-1-4-2"></a>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">Clocking</td>
<td class="left">C-c C-x C-i</td>
<td class="left">开始clock</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c C-x C-o</td>
<td class="left">退出clock</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c C-x C-r</td>
<td class="left">插入clock table</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c C-x ;</td>
<td class="left">Start a count down time</td>
</tr>
</tbody>
</table>

    ;; config for clocking
    ;; (global-set-key (kbd "<f9> I") 'bh/punch-in)
    ;; (global-set-key (kbd "<f9> O") 'bh/punch-out)
    
    ;; (global-set-key (kbd "<f9> l") 'org-toggle-link-display)
    ;; (global-set-key (kbd "<f9> SPC") 'bh/clock-in-last-task)
    
    ;; (global-set-key (kbd "<f11>") 'org-clock-goto)
    ;; (global-set-key (kbd "C-<f11>") 'org-clock-in)

## Picture drawing mode<a id="sec-1-5" name="sec-1-5"></a>

此功能可以支持在org-mdoe中通过文本方式，或代码方式进行画图，通过plantuml, ditaa等插件来进行画图。

### Configuration<a id="sec-1-5-1" name="sec-1-5-1"></a>

    ;;================================================================
    ;; Config for Picture Drawing
    ;;================================================================
    ;; set for plantuml
    (setq org-ditaa-jar-path "~/.emacs.d/ditaa0_9.jar")
    (setq org-plantuml-jar-path "~/.emacs.d/plantuml.8031.jar")
    ;; Use fundamental mode when editing plantuml blocks with C-c '
    (add-to-list 'org-src-lang-modes (quote ("plantuml" . fundamental)))
