03-editing/init-org-mode.md

### How to use it<a id="sec-1-5-2" name="sec-1-5-2"></a>

<http://www.plantuml.com/>
-   安装依赖
    在archlinux的aur中找到plantuml进行安装；
-   使用，在需要生成的图的位置代码用如何代码框起来

     #+begin_src plantuml :file some_filename.png :cmdline -r -s 0.8
    <context of ditaa source goes here>
     #+end_src

## Config for TODO<a id="sec-1-6" name="sec-1-6"></a>

TODO用来管理org mode中的任务状态，如下配置中，将任务状态分配置为下面几种；

### Configuration<a id="sec-1-6-1" name="sec-1-6-1"></a>

    ;;================================================================
    ;; Config for TODO Configuration
    ;;================================================================
    ;; (setq org-todo-keywords
    ;;       (quote (;;(sequence "TODO(t)" "NEXT(n)" "MAYBE(m)" "STARTED(s)" "APPT(a)" "|" "DONE(d)")
    ;;               (sequence "TODO(t)" "NEXT(n)" "STARTED(s)" "|" "DONE(d)")
    ;;               (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)" "PHONE" "MEETING"))))
    
    (setq org-todo-keywords
          (quote ((sequence "TODO(t)" "NEXT(n)" "STARTED(s)" "MAYBE(m)" "|" "DONE(d!/!)")
                  (sequence "PROJECT(p)" "|" "DONE(d!/!)" "CANCELLED(c@/!)")
                  (sequence "WAITING(w@/!)" "HOLD(h)" "|" "CANCELLED(c@/!)"))))
    
    (setq org-todo-keyword-faces
          (quote (;;("NEXT" :inherit warning)
                  ("PROJECT" :inherit font-lock-string-face)
                  ("TODO" :foreground "red" :weight bold)
                  ("NEXT" :foreground "blue" :weight bold)
                  ("STARTED" :foreground "green" :weight bold)
                  ("DONE" :foreground "forest green" :weight bold)
                  ("WAITING" :foreground "orange" :weight bold)
                  ("MAYBE" :foreground "grey" :weight bold)
                  ("HOLD" :foreground "magenta" :weight bold)
                  ("CANCELLED" :foreground "forest green" :weight bold)
                  )))
    
    
    (setq org-use-fast-todo-selection t)
    (setq org-todo-state-tags-triggers
          (quote (("CANCELLED" ("CANCELLED" . t))
                  ("WAITING" ("WAITING" . t))
                  ("MAYBE" ("WAITING" . t))
                  ("HOLD" ("WAITING") ("HOLD" . t))
                  (done ("WAITING") ("HOLD"))
                  ("TODO" ("WAITING") ("CANCELLED") ("HOLD"))
                  ("NEXT" ("WAITING") ("CANCELLED") ("HOLD"))
                  ("DONE" ("WAITING") ("CANCELLED") ("HOLD")))))

### Shot-key bindings<a id="sec-1-6-2" name="sec-1-6-2"></a>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c C-t</td>
<td class="left">设置TODO标签</td>
</tr>
</tbody>
</table>

## Config for Tag<a id="sec-1-7" name="sec-1-7"></a>

### Configuration<a id="sec-1-7-1" name="sec-1-7-1"></a>

    ;;================================================================
    ;; Config for Tags
    ;;================================================================
    ;; Config TODO tags
    (setq org-tag-alist '((:startgroup)
                          ("Develop" . ?1)
                          (:grouptags )
                          ("陆健美" . ?z)
                          (:endgroup)
    
                          ))
    ;; Allow setting single tags without the menu
    (setq org-fast-tag-selection-single-key (quote expert))
    
    ;; For tag searches ignore tasks with scheduled and deadline dates
    (setq org-agenda-tags-todo-honor-ignore-options t)

### Shot-key binding<a id="sec-1-7-2" name="sec-1-7-2"></a>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">Tags</td>
<td class="left">C-c C-c C-c</td>
<td class="left">打开tag选择窗口，然后通过字母索引选择tag</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">SPC</td>
<td class="left">清除所有tag</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c C-c</td>
<td class="left">可以直接输入tag的单词直接进行选择</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c C-x C-c</td>
<td class="left">打开列展示视图</td>
</tr>


<tr>
<td class="left">&#xa0;</td>
<td class="left">q</td>
<td class="left">退出列视图</td>
</tr>
</tbody>
</table>

## Global column view and properties<a id="sec-1-8" name="sec-1-8"></a>

Column view是建立于org-mode任务管理之上的快速以表格查看各个任务情况的视图，可以使用 **C-c C-x C-c** 来打开column view，而此种查看方式只是一种查看，并不会被打印，如果需要通过动态管理column view，并支持打印，可以通过 **C-c C-x i** 插入一个动态的column部分在文件中，但此部分不是动态关联的，即修改了任务内容，插入的column view是不会更新的，但可以通过执行 **C-c C-x C-u** 进行更新；注：已经通过配置(add-hook 'before-save-hook 'org-update-all-dblocks)达到在保存文件时，即会更新文件中所有的column view中的数据；
当需要针对某一个特定的任务组生成一个column view时，可以在此任务组的任务上，执行 **C-c C-x p** 插入属性，选择id，输入一个id值，然后在插入动态column时，选择刚刚输入的id值即可；如果需要对这个表特殊定义不同的column结构，可以再执行 **C-c C-x p** 时选择 **COLUMN** 来重新定义一个新的column结构内容；保存即可自动更新表s格；

    ;;================================================================
    ;; Config for Global column view and properties
    ;;================================================================
    ;; Set default column view headings: Task Effort Clock_Summary
    ;;(setq org-columns-default-format "%25ITEM %10Effort(Effort){:} %SCHEDULED %DEADLINE %11Status %20TAGS %PRIORITY %TODO")
    ;;(setq org-columns-default-format "%25ITEM  %9Approved(Approved?){X} %SCHEDULED %DEADLINE %11Status %TAGS %PRIORITY %TODO")
    (setq org-columns-default-format
          ;;" %TODO %30ITEM %15DEADLINE %15SCHEDULED %3PRIORITY %10TAGS %5Effort(Effort){:} %6CLOCKSUM"
          " %TODO %30ITEM %15DEADLINE %15SCHEDULED %3PRIORITY %10TAGS %5Effort(Effort){:}"
          )
    
    ;; global Effort estimate values
    ;; global STYLE property values for completion
    (setq org-global-properties (quote (
                                        ;;("Effort_ALL" . "0:15 0:30 0:45 1:00 2:00 3:00 4:00 5:00 6:00 0:00")
                                        ("Status_ALL" . "Not-start In-Progress Delay Finished Cancled")
                                        ("ID_ALL" . "")
                                        ("STYLE_ALL" . "habit"))))
    ;; update dynamic blocks when save file
    (add-hook 'before-save-hook 'org-update-all-dblocks)
