03-editing/init-org-mode.md

## Config for File Export PDF Format<a id="sec-1-10" name="sec-1-10"></a>

### Configuration<a id="sec-1-10-1" name="sec-1-10-1"></a>

    ;;================================================================
    ;; Config for File Export To PDF 
    ;;================================================================ 
    ;; config for export PDF
    (require 'ox-latex)
    (add-hook 'org-mode-hook
              (lambda () (setq truncate-lines nil)))
    ;;(require 'org-install)
    
    ;; 使用xelatex一步生成PDF
    
    
    (setq org-latex-pdf-process '("xelatex -interaction nonstopmode %f"
                                  "xelatex -interaction nonstopmode %f"))
    ;; code执行免应答（Eval code without confirm）
    (setq org-confirm-babel-evaluate nil)
    
    ;; Auctex
    
    (setq TeX-auto-save t)
    (setq TeX-parse-self t)
    (setq-default TeX-master nil)
    
    (unless (boundp 'org-latex-classes)
      (setq org-latex-classes nil))
    
    (add-to-list 'org-latex-classes
                 '("cn-article"
                   "\\documentclass[10pt,a4paper]{article}
    \\usepackage{graphicx}
    \\usepackage{xcolor}
    
    \\usepackage{lmodern}
    \\usepackage{verbatim}
    \\usepackage{fixltx2e}
    \\usepackage{longtable}
    \\usepackage{float}
    \\usepackage{tikz}
    \\usepackage{wrapfig}
    \\usepackage{soul}
    \\usepackage{textcomp}
    \\usepackage{listings}
    \\usepackage{geometry}
    \\usepackage{algorithm}
    \\usepackage{algorithmic}
    \\usepackage{marvosym}
    \\usepackage{wasysym}
    \\usepackage{latexsym}
    \\usepackage{natbib}
    \\usepackage{fancyhdr}
    %\\usepackage{comment}
    
    \\usepackage{zhfontcfg} % added my own sty file under /usr/local/texlive/texmf-local/tex/latex/local
    
    \\usepackage[xetex,colorlinks=true,CJKbookmarks=true,
    linkcolor=blue,
    urlcolor=blue,
    menucolor=blue]{hyperref}
    \\usepackage{xunicode,xltxtra}
    
    \\hypersetup{unicode=true}
    \\geometry{a4paper, textwidth=6.5in, textheight=10in,
    marginparsep=7pt, marginparwidth=.6in}
    
    \\XeTeXlinebreakskip = 0pt plus 1pt
    
    \\definecolor{foreground}{RGB}{220,220,204}%浅灰
    \\definecolor{background}{RGB}{62,62,62}%浅黑
    \\definecolor{preprocess}{RGB}{250,187,249}%浅紫
    \\definecolor{var}{RGB}{239,224,174}%浅肉色
    \\definecolor{string}{RGB}{154,150,230}%浅紫色
    \\definecolor{type}{RGB}{225,225,116}%浅黄
    \\definecolor{function}{RGB}{140,206,211}%浅天蓝
    \\definecolor{keyword}{RGB}{239,224,174}%浅肉色
    \\definecolor{comment}{RGB}{180,98,4}%深褐色
    \\definecolor{doc}{RGB}{175,215,175}%浅铅绿
    \\definecolor{comdil}{RGB}{111,128,111}%深灰
    \\definecolor{constant}{RGB}{220,162,170}%粉红
    \\definecolor{buildin}{RGB}{127,159,127}%深铅绿
    \\title{}
    \\fancyfoot[C]{\\bfseries\\thepage}
    \\chead{\\MakeUppercase\\sectionmark}
    \\pagestyle{fancy}
    \\tolerance=1000
    [NO-DEFAULT-PACKAGES]
    [NO-PACKAGES]

    
    ;; 使用Listings宏包格式化源代码(只是把代码框用listing环境框起来，还需要额外的设置)
    (setq org-latex-listings t)
    ;; Options for \lset command（reference to listing Manual)
    (setq org-latex-listings-options
          '(
            ("basicstyle" "\\color{foreground}\\small\\mono")           ; 源代码字体样式
            ("keywordstyle" "\\color{function}\\bfseries\\small\\mono") ; 关键词字体样式
            ;;("identifierstyle" "\\color{doc}\\small\\mono")
            ;;("commentstyle" "\\color{comment}\\small\\itshape")         ; 批注样式
            ("stringstyle" "\\color{string}\\small")                    ; 字符串样式
            ("showstringspaces" "false")                                ; 字符串空格显示
            ("numbers" "left")                                          ; 行号显示
            ("numberstyle" "\\color{preprocess}")                       ; 行号样式
            ("stepnumber" "1")                                          ; 行号递增
            ("backgroundcolor" "\\color{background}")                   ; 代码框背景色
            ("tabsize" "4")                                             ; TAB等效空格数
            ("captionpos" "t")                                          ; 标题位置 top or buttom(t|b)
            ("breaklines" "true")                                       ; 自动断行
            ("breakatwhitespace" "true")                                ; 只在空格分行
            ("showspaces" "false")                                      ; 显示空格
            ("columns" "flexible")                                      ; 列样式
            ("frame" "single")                                          ; 代码框：阴影盒
            ("frameround" "tttt")                                       ; 代码框： 圆角
            ("framesep" "0pt")
            ("framerule" "8pt")
            ("rulecolor" "\\color{background}")
            ("fillcolor" "\\color{white}")
            ("rulesepcolor" "\\color{comdil}")
            ("framexleftmargin" "10mm")
            ))
    ;; Make Org use ido-completing-read for most of its completing prompts.
    (setq org-completion-use-ido t)
    ;; 各种Babel语言支持
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((R . t)
       (emacs-lisp . t)
       (matlab . t)
       (C . t)
       (perl . t)
       ;;(objc . t)
       (sh . t)
       (ditaa . t)
       (plantuml . t)
       (org . t)
       (python . t)
       (sh . t)
       (dot . t)
       (haskell . t)
       (dot . t)
       (latex . t)
       (java . t)
       (js . t)
       ))
