03-editing/init-org-mode.md

### <a id="sec-1-10-2" name="sec-1-10-2"></a>

## Config for File Export PDF but use beamer Format<a id="sec-1-11" name="sec-1-11"></a>

### Configuration<a id="sec-1-11-1" name="sec-1-11-1"></a>


# Orgmode table Configuration<a id="sec-2" name="sec-2"></a>

    ;;================================================================
    ;; Config for Org Table, customized some function for operate on cells
    ;;================================================================
    (defun org-table-swap-cells (i1 j1 i2 j2)
      "Swap two cells"
      (let ((c1 (org-table-get i1 j1))
            (c2 (org-table-get i2 j2)))
        (org-table-put i1 j1 c2)
        (org-table-put i2 j2 c1)
        (org-table-align)))
    
    (defun org-table-move-single-cell (direction)
      "Move the current cell in a cardinal direction according to the
      parameter symbol: 'up 'down 'left 'right. Swaps contents of
      adjacent cell with current one."
      (unless (org-at-table-p)
        (error "No table at point"))
      (let ((di 0) (dj 0))
        (cond ((equal direction 'up) (setq di -1))
              ((equal direction 'down) (setq di +1))
              ((equal direction 'left) (setq dj -1))
              ((equal direction 'right) (setq dj +1))
              (t (error "Not a valid direction, must be up down left right")))
        (let* ((i1 (org-table-current-line))
               (j1 (org-table-current-column))
               (i2 (+ i1 di))
               (j2 (+ j1 dj)))
          (org-table-swap-cells i1 j1 i2 j2)
          (org-table-goto-line i2)
          (org-table-goto-column j2))))
    
    (defun org-table-move-single-cell-up ()
      "Move a single cell up in a table; swap with anything in target cell"
      (interactive)
      (org-table-move-single-cell 'up))
    
    (defun org-table-move-single-cell-down ()
      "Move a single cell down in a table; swap with anything in target cell"
      (interactive)
      (org-table-move-single-cell 'down))
    
    (defun org-table-move-single-cell-left ()
      "Move a single cell left in a table; swap with anything in target cell"
      (interactive)
      (org-table-move-single-cell 'left))
    
    (defun org-table-move-single-cell-right ()
      "Move a single cell right in a table; swap with anything in target cell"
      (interactive)
      (org-table-move-single-cell 'right))
    
    (provide 'init-org-table-shift)
    ;; init-org-table-shift.el end here

# Chinese-font-setup<a id="sec-3" name="sec-3"></a>

在Org-mode中，编辑表格并让表格的分隔线对齐是一件不太容易的事情，主要原因是因为Org-mode中编辑时字母与汉字同时存在时，则字母字体长度与汉字字体宽度不同的原因导致，因此这里的主要解决方案是找到一种通用等宽字体，通过字体的配置来达到最终表格对齐正常。
感谢Chinese-font-setup的包开发者：

## Configuration<a id="sec-3-1" name="sec-3-1"></a>

    ;; add font-config for chinese double-width fonts issue
    (use-package chinese-fonts-setup
      :config
      (setq cfs-profiles
            '("program" "org-mode" "read-book"))
    )

## Shot key binding<a id="sec-3-2" name="sec-3-2"></a>

    ;; Reset Increase Font size and Descrease Font size short key binding after using chinese-font-setup plugin
    ;; Reference: https://github.com/tumashu/chinese-fonts-setup
    (global-unset-key (kbd "C-x C-=")) ;; remove original font-resize
    (global-set-key (kbd "C-x C-=") 'cfs-increase-fontsize)
    (global-set-key (kbd "C-x M-=") 'cfs-decrease-fontsize)

# Key bindings for Orgmode<a id="sec-4" name="sec-4"></a>

## Key bindings configurations<a id="sec-4-1" name="sec-4-1"></a>

    ;; -----------------------------------------
    ;;key bindings for org mode
    ;; -----------------------------------------
    
    (global-unset-key (kbd "C-'")) ;; this setting has no use, and conflict with smart
    
    
    ;;(global-set-key (kbd "<f12>") 'org-agenda) ;; configured blew
    (global-set-key (kbd "<f9> c") 'calendar)
    (global-set-key (kbd "<f9> v") 'visible-mode)
    (global-set-key (kbd "C-c c") 'org-capture)
    
    ;; add ~/notes/front-end-dev-plan.org into agenda
    ;; (setq org-agenda-files (list "~/notes/front-end-dev-plan.org"))
    (global-set-key "\C-c a" 'org-agenda)
    ;; I use C-c c to start capture mode
    (global-set-key (kbd "C-c c") 'org-capture)
    
    
    ;; config for export-mutilpul files
    (global-set-key (kbd "C-<f12>") 'bh/save-then-publish)
    
    ;; config for clocking
    (global-set-key (kbd "<f9> I") 'bh/punch-in)
    (global-set-key (kbd "<f9> O") 'bh/punch-out)
    
    (global-set-key (kbd "<f9> l") 'org-toggle-link-display)
    (global-set-key (kbd "<f9> SPC") 'bh/clock-in-last-task)
    
    (global-set-key (kbd "<f11>") 'org-clock-goto)
    (global-set-key (kbd "C-<f11>") 'org-clock-in)
