03-editing/init-org-mode.org
** Key binding for org-mode

#+CAPTION: Org-mode快捷键
     #+ATTR_LATEX: :environment longtable :align l|l|l
| 分类          | 快捷键                     | 说明                                                                                      |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| org-mode      | C-RET                      | 加入同级别索引                                                                            |
|               | M-RET                      | 加入同级别的列表                                                                          |
|               | C-c C-t                    | 设置TODO标签                                                                              |
|               | M-left/M-right             | 修改任务等级，子任务不跟着变化                                                            |
|               | M-S-up/down                | 调整此任务节点等级，子任务跟着变化                                                        |
|               | C-c -                      | 更换列表标记(循环)                                                                        |
|               | M-S-RET                    | 新增一个子项                                                                              |
|               | M-up/M-down                | 调整此任务节点的顺序                                                                      |
|               | C-c b                      | 只编辑当前级别列表                                                                        |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| outline       | C-c C-p                    | 上一个标题                                                                                |
|               | C-c C-n                    | 下一下                                                                                    |
|               | C-c C-f                    | 同一级的上一个                                                                            |
|               | C-c C-b                    | 同一级的下一个                                                                            |
|               | C-c C-u                    | 回到上一级标题                                                                            |
|               | C-c C-j                    | 跳转标题                                                                                  |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| column        | C-c C-x C-c                | 打开column视图模式                                                                        |
|               | r                          | 刷新                                                                                      |
|               | q                          | 退出                                                                                      |
|               | <left> <right> <up> <down> | 视图之间跳转                                                                              |
|               | v                          | 查看属性完整值                                                                            |
|               | C-c C-x i                  | 插入column视图在文件中                                                                    |
|               | C-c C-x C-u                | 更新column视图中的值，需要进入表格中执行                                                  |
|               | C-u C-c C-x C-u            | 更新此文件中所有的column视图内容                                                          |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| Property      | C-c C-x p                  | 设置一个属性                                                                              |
|               | C-c C-x p COLUMN           | 设置column，内容可以为%25ITEM 10%ITEM 5%TODO 30%SCEDULE 30%DEADLINE                       |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| Tags          | C-c C-c C-c                | 打开tag选择窗口，然后通过字母索引选择tag                                                  |
|               | SPC                        | 清除所有tag                                                                               |
|               | C-c C-c                    | 可以直接输入tag的单词直接进行选择                                                         |
|               | C-c C-x C-c                | 打开列展示视图                                                                            |
|               | q                          | 退出列视图                                                                                |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| Planning      | C-c .                      | 设置时间                                                                                  |
|               | S-left/S-right             | 在日历中选择时间                                                                          |
|               | M-n/M-p                    | 设置任务的优先级                                                                          |
|               | C-c C-s                    | 设置任务开始时间, schedlued                                                               |
|               | C-c C-d                    | 设置任务结束时间，deadline                                                                |
|               | C-c / d                    | 显示警告天数之内的Deadline任务                                                            |
|               | C-u C-c / d                | 显示所有的deadline任务                                                                    |
|               | C-1 C-c / d                | 查看一天之内接近的deadline任务列表                                                        |
|               | C-c / b                    | 查看指定日期之前的deadline, schedule任务列表                                              |
|               | C-c / a                    | 查看指定日期之后的deadline, schedule任务列表                                              |
|               | C-c .                      | 插入时间(Timestamps)                                                                      |
|               | S-left/right               | 光标在时间上时，用于往前一天往后一天调整                                                  |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| Clocking      | C-c C-x C-i                | 开始clock                                                                                 |
|               | C-c C-x C-o                | 退出clock                                                                                 |
|               | C-c C-x C-r                | 插入clock table                                                                           |
|               | C-c C-x ;                  | Start a count down time                                                                   |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| Agenda        | C-c a                      | 打开agenda view, 然后根据显示视图进行选择性显示                                           |
|               | C-c [                      | 添加当前文件进入agenda-view-file中                                                        |
|               | C-c ]                      | 删除当前文件从agenda-view-file中                                                          |
|               | C-c C-x <                  | 强制限制只使用当前文件或当前节点来显示agenda-view                                         |
|               | C-c C-x >                  | 取消以上限制                                                                              |
|               | C-c a t                    | 显示TODO列表                                                                              |
|               | C-c a T                    | 可以指定要显示的状态列表，多个状态使用"竖线"隔开显示                                      |
|               | C-c a m                    | 匹配 tags and properties                                                                  |
|               | C-c a M                    | 匹配搜索的tag                                                                             |
|               | C-c a L                    | 采用timeline的方式显示此项目，只能在一个单文件上执行此操作                                |
|               | C-c a s                    | 按搜索关键查询                                                                            |
|               | C-c a #                    | 列出项目暂停的任务                                                                        |
|               | C-c C-w                    | 导出文件                                                                                  |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| Agenda column | C-c C-x C-c                | 打开column模式在agenda view中                                                             |
|               |                            |                                                                                           |
|               |                            |                                                                                           |
|               |                            |                                                                                           |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| Capture       | C-c c                      | 打开capture                                                                               |
|               |                            |                                                                                           |
|               |                            |                                                                                           |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| Export        | C-<f12>                    | 一次性生成所有目录的org文件为html文件，发布配置见.emacs.d中的配置目录                     |
|               | C-c C-e                    | 导出                                                                                      |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| Tables        | C-c 竖线                   | 插入表格                                                                                  |
|               | C-c -                      | 在下面添加水平线                                                                          |
|               | C-c RET                    | 添加水平线并跳转到下一行                                                                  |
|               | C-m                        | 在本列下面添加一行                                                                        |
|               | M-S-Right                  | 在本列后面添加一列                                                                        |
|               | M-S-Down                   | 在本行上面添加一行                                                                        |
|               | M-S-Left                   | 删除本列                                                                                  |
|               | M-S-UP                     | 删除本行                                                                                  |
|               | M-left/right               | 移动列                                                                                    |
|               | M-Up/Down                  | 移动行                                                                                    |
|               | C-c C-c                    | 重新定义表格                                                                              |
|               | C-c `                      | 修改隐藏的表格中的内容                                                                    |
|               | TAB                        | 跳转下一个单元格                                                                          |
|               | M-a / S-tab                | 跳转到上一个单元格                                                                        |
|               | C-c SPAC                   | 清除当前单元格内容                                                                        |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| Aligns        | M-x cfs-switch-profile     | 修改一下当前buffer使用的字体profile，表格对齐需要按中英文字体宽度相同配置                 |
|               | M-x cfs-edit-profile       | 修改当前profile的配置，可以在修改字体和大小后，在对应的字体大小行上，执行C-c C-c测试      |
|               | M-x cfs-increase-fontsize  | 放大字体，按等宽方式放大，已经绑定快捷键C-x C-=                                           |
|               | M-x cfs-decrease-fontsize  | 缩小字体，按等宽方式缩小，已经绑定快捷键C-x M-=                                           |
|               |                            |                                                                                           |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| Archive       | C-c C-x a                  | 内部归档，将本任务下的所有子任务标识为灰色，默认将是不可打开的状态，可以通过C-TAB进行打开 |
|               | C-TAB                      | 打开内部归档后的任务                                                                      |
|               | C-c C-x A                  | 将此任务迁移入一个名为"Archive"的标记条下                                                 |
|               | C-c C-x C-a                | 将此任务迁移到与当前文件名相同名称+_archive的文件中                                       |
|               | C-c C-x C-s                | 同上                                                                                      |
|               |                            |                                                                                           |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| Refile        | C-c C-w                    | 将此标签任务迁移到其它文件中                                                              |
|               | C-c M-w                    | 同上，并保留当前文件内容                                                                  |
| Helm-org      | C-x c i                    | 显示当前文件中所有的headings，支持搜索和切换                                                                |
|               |                            |                                                                                           |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|

