03-editing/init-org-mode.org
* Org文件批量管理



* End of file
#+begin_src emacs-lisp :tangle yes

(provide 'init-org-mode)
;; init-org-mode.el end here

#+end_src
