03-editing/init-org-mode.md

# Org文件批量管理<a id="sec-5" name="sec-5"></a>

# End of file<a id="sec-6" name="sec-6"></a>

    (provide 'init-org-mode)
    ;; init-org-mode.el end here
